## Production
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
/setup/ relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/fourkeys/fourkeys/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/fourkeys/fourkeys

To view this run in a browser, visit:
https://app.terraform.io/app/commoncode/fourkeys/runs/run-xtvm2r4yVKmLXjSd

Waiting for the plan to start...

Terraform v1.1.8
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
random_id.event_handler_random_value: Refreshing state... [id=4QpcGtjTCfhUB1Y0wQ23OtPGBCE]
google_project_service.run_api: Refreshing state... [id=fourkeys-009742/run.googleapis.com]
google_project_service.bq_api: Refreshing state... [id=fourkeys-009742/bigquery.googleapis.com]
google_project_service.sm_api: Refreshing state... [id=fourkeys-009742/secretmanager.googleapis.com]
google_service_account.fourkeys: Refreshing state... [id=projects/fourkeys-009742/serviceAccounts/fourkeys@fourkeys-009742.iam.gserviceaccount.com]
google_project_iam_member.parser_run_invoker: Refreshing state... [id=fourkeys-009742/roles/run.invoker/serviceAccount:fourkeys@fourkeys-009742.iam.gserviceaccount.com]
google_project_iam_member.parser_bq_project_access: Refreshing state... [id=fourkeys-009742/roles/bigquery.user/serviceAccount:fourkeys@fourkeys-009742.iam.gserviceaccount.com]
google_secret_manager_secret.event_handler: Refreshing state... [id=projects/fourkeys-009742/secrets/event-handler]
module.data_parser_service["github"].google_cloud_run_service.parser: Refreshing state... [id=locations/australia-southeast1/namespaces/fourkeys-009742/services/github-parser]
google_cloud_run_service.event_handler: Refreshing state... [id=locations/australia-southeast1/namespaces/fourkeys-009742/services/event-handler]
google_bigquery_dataset.four_keys: Refreshing state... [id=projects/fourkeys-009742/datasets/four_keys]
module.data_parser_service["github"].google_pubsub_topic.parser: Refreshing state... [id=projects/fourkeys-009742/topics/github]
module.dashboard_service.google_cloud_run_service.dashboard: Refreshing state... [id=locations/australia-southeast1/namespaces/fourkeys-009742/services/fourkeys-grafana-dashboard]
google_secret_manager_secret_iam_member.event_handler: Refreshing state... [id=projects/fourkeys-009742/secrets/event-handler/roles/secretmanager.secretAccessor/serviceAccount:fourkeys@fourkeys-009742.iam.gserviceaccount.com]
google_secret_manager_secret_version.event_handler: Refreshing state... [id=projects/810750187524/secrets/event-handler/versions/2]
module.data_parser_service["github"].google_pubsub_topic_iam_member.event_handler: Refreshing state... [id=projects/fourkeys-009742/topics/github/roles/editor/serviceAccount:fourkeys@fourkeys-009742.iam.gserviceaccount.com]
google_bigquery_routine.func_multiFormatParseTimestamp: Refreshing state... [id=projects/fourkeys-009742/datasets/four_keys/routines/multiFormatParseTimestamp]
google_bigquery_dataset_iam_member.parser_bq: Refreshing state... [id=projects/fourkeys-009742/datasets/four_keys/roles/bigquery.dataEditor/serviceAccount:fourkeys@fourkeys-009742.iam.gserviceaccount.com]
google_bigquery_routine.func_json2array: Refreshing state... [id=projects/fourkeys-009742/datasets/four_keys/routines/json2array]
google_bigquery_table.events_raw: Refreshing state... [id=projects/fourkeys-009742/datasets/four_keys/tables/events_raw]
google_bigquery_table.view_deployments: Refreshing state... [id=projects/fourkeys-009742/datasets/four_keys/tables/deployments]
google_bigquery_table.view_changes: Refreshing state... [id=projects/fourkeys-009742/datasets/four_keys/tables/changes]
google_bigquery_table.view_incidents: Refreshing state... [id=projects/fourkeys-009742/datasets/four_keys/tables/incidents]
google_cloud_run_service_iam_binding.noauth: Refreshing state... [id=v1/projects/fourkeys-009742/locations/australia-southeast1/services/event-handler/roles/run.invoker]
module.dashboard_service.google_cloud_run_service_iam_binding.noauth: Refreshing state... [id=v1/projects/fourkeys-009742/locations/australia-southeast1/services/fourkeys-grafana-dashboard/roles/run.invoker]
module.data_parser_service["github"].google_pubsub_subscription.parser: Refreshing state... [id=projects/fourkeys-009742/subscriptions/github-subscription]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_secret_manager_secret_iam_member.sentry_client will be created
  + resource "google_secret_manager_secret_iam_member" "sentry_client" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:fourkeys@fourkeys-009742.iam.gserviceaccount.com"
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "projects/fourkeys-009742/secrets/sentry-client"
    }

  # module.dashboard_service.google_cloud_run_service.dashboard will be updated in-place
  ~ resource "google_cloud_run_service" "dashboard" {
        id                         = "locations/australia-southeast1/namespaces/fourkeys-009742/services/fourkeys-grafana-dashboard"
        name                       = "fourkeys-grafana-dashboard"
        # (4 unchanged attributes hidden)


      ~ template {

          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                    # (3 unchanged attributes hidden)


                  ~ ports {
                      - name           = "http1" -> null
                        # (1 unchanged attribute hidden)
                    }

                    # (2 unchanged blocks hidden)
                }
            }
            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

```
</details>
*Pusher: @dinie, Action: `pull_request`*